_out/params.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-08-30 Mon 21:07 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ccd1ad">DeploymentName</a></li>
<li><a href="#org9c77703">KeyName</a></li>
<li><a href="#orgb6cc534">SSHCIDR</a></li>
</ul>
</div>
</nav>
<p>
This document contains some common CloudFormation parameters which are included
in other documents in this project.
</p>

<p>
Parameter names should adhere to AWS <a href="https://aws-quickstart.github.io/naming-parms.html">parameter naming standards</a>.
</p>

<div id="outline-container-org1ccd1ad" class="outline-2">
<h2 id="org1ccd1ad"><a href="#org1ccd1ad">DeploymentName</a></h2>
<div class="outline-text-2" id="text-org1ccd1ad">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">DeploymentName</span>:
    <span style="color: #dcaeea;">Type</span>: String
    <span style="color: #dcaeea;">Description</span>: A name for this deployment
</pre>
</div>

<p>
A <b>deployment</b> is a deployed application, potentially comprised of many
CloudFormation stacks. This is sometimes called an "environment", but that is an
overloaded and confusing term. Use the <code>DeploymentName</code> to indicate which
logical deployment a stack belongs to.
</p>

<p>
If a deployment is completely specified by exactly one CloudFormation template,
the <code>DeploymentName</code> and the <a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/pseudo-parameter-reference.html#cfn-pseudo-param-stackname">AWS::StackName</a> would refer to the same things. In
that case, consider not using a <code>DeploymentName</code> parameter.
</p>
</div>
</div>

<div id="outline-container-org9c77703" class="outline-2">
<h2 id="org9c77703"><a href="#org9c77703">KeyName</a></h2>
<div class="outline-text-2" id="text-org9c77703">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">KeyName</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::EC2::KeyPair::KeyName
    <span style="color: #dcaeea;">Description</span>: The name of an EC2 KeyPair
    <span style="color: #dcaeea;">Default</span>: test
</pre>
</div>

<p>
AWS does not provide a CloudFormation type for EC2 KeyPairs. This is a
deliberate choice: a KeyPair consists of a public and private key, and AWS does
not want to expose the private key in CloudFormation outputs.
</p>

<p>
This is one example where Terraform has an advantage: since Terraform runs
locally, it can create a KeyPair and save the private key locally.
</p>

<p>
In CloudFormation, you have two options:
</p>

<ol class="org-ol">
<li>Create the KeyPair beforehand, then provide the <code>KeyName</code> to your
CloudFormation template as a parameter.</li>
<li>Create the KeyPair using a CloudFormation Custom Resource (i.e. a Lambda
Function) defined in your CloudFormation template. The Custom Resource must
save the private key somewhere (like SecretsManager or SSM Parameter Store).</li>
</ol>
</div>
</div>

<div id="outline-container-orgb6cc534" class="outline-2">
<h2 id="orgb6cc534"><a href="#orgb6cc534">SSHCIDR</a></h2>
<div class="outline-text-2" id="text-orgb6cc534">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">SSHCIDR</span>:
    <span style="color: #dcaeea;">Type</span>: String
    <span style="color: #dcaeea;">Description</span>: IP CIDR range
</pre>
</div>

<p>
Allow SSH access from this CIDR range.
</p>
</div>
</div>
</div>
</body>
</html>
